Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ViewDoesNotSupportCenterToCenter
The "Center to Center" option is not supported by this view because it is empty. "Origin to Internal Origin" has been used instead.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.LevelRenamedOnImport
This level has been renamed from [SourceLevelName] to avoid duplication.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ImportedModelWithDifferentLengthUnits
The imported model uses different length units, Revit will default to auto-detect.

Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricData
The original model contains unsupported geometric data.